app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Florida"], ["content", "sALIDA"], ["updated_at", "2016-06-04 03:27:22.638335"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)